Repository: M-S-JABER/NetToolbox
Catalog: NetToolbox.swiftpm/Resources/Localizable.xcstrings
Source language: en
Languages: ar

# app.title
source: NetToolbox
ar: عدة الشبكات

# category.calculators
source: Calculators
ar: حاسبات

# category.diagnostics
source: Diagnostics
ar: تشخيص

# category.localNetwork
source: Local Network
ar: الشبكة المحلية

# category.professional
source: Professional
ar: احترافي

# common.calculate
source: Calculate
ar: احسب

# common.clear
source: Clear
ar: مسح

# common.copied
source: Copied
ar: تم النسخ

# common.copy
source: Copy
ar: نسخ

# common.error
source: Error
ar: خطأ

# common.history
source: Recent
ar: السجل الأخير

# common.invalidInput
source: Invalid input
ar: إدخال غير صالح

# common.loading
source: Loading…
ar: جارٍ التحميل…

# common.refresh
source: Refresh
ar: تحديث

# common.retry
source: Retry
ar: إعادة المحاولة

# common.search
source: Search
ar: بحث

# common.soon
source: Soon
ar: قريباً

# error.mac.invalid
source: Invalid MAC address. Enter 12 hex digits in any common format.
ar: عنوان MAC غير صالح. أدخل 12 خانة سداسية عشرية بأي صيغة شائعة.

# error.network.badStatus
source: The server returned an error.
ar: أعاد الخادم خطأ.

# error.network.decoding
source: Unexpected response from the service.
ar: استجابة غير متوقعة من الخدمة.

# error.network.invalidURL
source: Invalid service URL.
ar: رابط الخدمة غير صالح.

# error.network.offline
source: No internet connection. Check your network and try again.
ar: لا يوجد اتصال بالإنترنت. تحقق من الشبكة وحاول مجدداً.

# error.subnet.invalidIPv4
source: Invalid IPv4 address. Use dotted form like 192.168.1.10.
ar: عنوان IPv4 غير صالح. استخدم الصيغة المنقوطة مثل 192.168.1.10.

# error.subnet.invalidIPv6
source: Invalid IPv6 address. Example: 2001:db8::1.
ar: عنوان IPv6 غير صالح. مثال: 2001:db8::1.

# error.subnet.invalidMask
source: Invalid subnet mask.
ar: قناع شبكة غير صالح.

# error.subnet.invalidPrefix
source: Invalid prefix. IPv4: 0–32, IPv6: 0–128.
ar: بادئة غير صالحة. ‏IPv4: من 0 إلى 32، وIPv6: من 0 إلى 128.

# error.subnet.nonContiguous
source: Subnet mask must be contiguous (ones followed by zeros).
ar: يجب أن يكون قناع الشبكة متصلاً (آحاد متبوعة بأصفار).

# mac.admin.local
source: Locally administered
ar: مُدار محلياً

# mac.admin.universal
source: Universally administered
ar: مُدار عالمياً (IEEE)

# mac.badge.identified
source: Identified
ar: تم التعرف

# mac.badge.randomized
source: Randomized / Private
ar: عشوائي / خاص

# mac.badge.unknown
source: Unknown OUI
ar: ‏OUI غير معروف

# mac.empty.description
source: Any format works: colons, dashes, Cisco dots or raw hex.
ar: أي صيغة مقبولة: نقطتان، شرطات، صيغة Cisco أو hex متصل.

# mac.empty.title
source: Enter a MAC address
ar: أدخل عنوان MAC

# mac.input.placeholder
source: AA:BB:CC:DD:EE:FF, aabb.ccdd.eeff, …
ar: AA:BB:CC:DD:EE:FF أو aabb.ccdd.eeff …

# mac.input.title
source: MAC address
ar: عنوان MAC

# mac.notFound
source: Vendor not in the offline database. Randomized (private) MACs cannot be identified.
ar: الشركة غير موجودة في قاعدة البيانات المحلية. عناوين MAC العشوائية (الخاصة) لا يمكن التعرف عليها.

# mac.result.cisco
source: Cisco notation
ar: صيغة Cisco

# mac.result.normalized
source: Normalized
ar: الصيغة الموحّدة

# mac.result.oui
source: OUI (first 24 bits)
ar: ‏OUI (أول 24 بت)

# mac.section.details
source: Details
ar: التفاصيل

# mac.section.vendor
source: Vendor
ar: الشركة المصنّعة

# mac.type.multicast
source: Multicast
ar: بث متعدد

# mac.type.unicast
source: Unicast
ar: أحادي

# ports.empty.description
source: Try a different number, service name or protocol filter.
ar: جرّب رقماً آخر أو اسم خدمة أو غيّر تصفية البروتوكول.

# ports.empty.title
source: No matching ports
ar: لا توجد منافذ مطابقة

# ports.filter.all
source: All
ar: الكل

# ports.filter.title
source: Protocol
ar: البروتوكول

# ports.footer
source: Service names and descriptions are shown in English as standard technical vocabulary.
ar: تُعرض أسماء الخدمات وأوصافها بالإنجليزية كونها مصطلحات تقنية معيارية.

# ports.search.placeholder
source: Port number or service name
ar: رقم المنفذ أو اسم الخدمة

# publicip.badge.online
source: Online
ar: متصل

# publicip.error.title
source: Fetch failed
ar: فشل الجلب

# publicip.local.empty
source: No active local interfaces found.
ar: لا توجد واجهات محلية نشطة.

# publicip.result.asn
source: ASN
ar: رقم النظام المستقل (ASN)

# publicip.result.city
source: City
ar: المدينة

# publicip.result.country
source: Country
ar: الدولة

# publicip.result.isp
source: ISP
ar: مزوّد الخدمة

# publicip.result.org
source: Organization
ar: المؤسسة

# publicip.result.timezone
source: Time zone
ar: المنطقة الزمنية

# publicip.section.local
source: Local addresses
ar: العناوين المحلية

# publicip.section.public
source: Public IP
ar: العنوان العام

# root.allTools
source: All Tools
ar: كل الأدوات

# root.categories
source: Categories
ar: الأقسام

# root.toolNotFound
source: Tool not found
ar: الأداة غير موجودة

# selftest.allPassed
source: All passed
ar: نجحت جميعها

# selftest.failures
source: Failures
ar: إخفاقات

# selftest.prompt
source: Run the suite to verify SubnetEngine, MAC parsing and the OUI database.
ar: شغّل الحزمة للتحقق من محرك الشبكات الفرعية وتحليل MAC وقاعدة OUI.

# selftest.run
source: Run tests
ar: تشغيل الاختبارات

# selftest.section.cases
source: Test cases
ar: حالات الاختبار

# selftest.section.summary
source: Summary
ar: الملخص

# subnet.empty.description
source: Type an IPv4 or IPv6 address with a mask or prefix, then tap Calculate.
ar: اكتب عنوان IPv4 أو IPv6 مع القناع أو البادئة ثم اضغط احسب.

# subnet.empty.title
source: Enter an address
ar: أدخل عنواناً

# subnet.input.address
source: IP address (e.g. 192.168.1.10 or 2001:db8::1)
ar: عنوان IP (مثال: 192.168.1.10 أو 2001:db8::1)

# subnet.input.mask
source: Mask / CIDR (24 or 255.255.255.0)
ar: القناع / CIDR (مثال: 24 أو 255.255.255.0)

# subnet.input.prefix
source: Prefix (e.g. 64)
ar: البادئة (مثال: 64)

# subnet.input.title
source: Input
ar: الإدخال

# subnet.result.addressBinary
source: Address (binary)
ar: العنوان (ثنائي)

# subnet.result.broadcast
source: Broadcast address
ar: عنوان البث

# subnet.result.cidr
source: CIDR prefix
ar: بادئة CIDR

# subnet.result.class
source: Address class
ar: فئة العنوان

# subnet.result.compressed
source: Compressed
ar: الصيغة المضغوطة

# subnet.result.expanded
source: Expanded
ar: الصيغة الكاملة

# subnet.result.firstHost
source: First usable host
ar: أول مضيف قابل للاستخدام

# subnet.result.lastHost
source: Last usable host
ar: آخر مضيف قابل للاستخدام

# subnet.result.maskBinary
source: Mask (binary)
ar: القناع (ثنائي)

# subnet.result.network
source: Network address
ar: عنوان الشبكة

# subnet.result.networkPrefix
source: Network prefix
ar: بادئة الشبكة

# subnet.result.prefixLength
source: Prefix length
ar: طول البادئة

# subnet.result.subnetMask
source: Subnet mask
ar: قناع الشبكة

# subnet.result.totalAddresses
source: Total addresses
ar: إجمالي العناوين

# subnet.result.usableHosts
source: Usable hosts
ar: عدد المضيفات القابلة للاستخدام

# subnet.result.wildcardMask
source: Wildcard mask
ar: قناع Wildcard

# subnet.scope.broadcast
source: Broadcast
ar: بث عام

# subnet.scope.linkLocal
source: Link-local
ar: محلي الوصلة

# subnet.scope.loopback
source: Loopback
ar: استرجاع (Loopback)

# subnet.scope.multicast
source: Multicast
ar: بث متعدد

# subnet.scope.private
source: Private
ar: خاص

# subnet.scope.public
source: Public
ar: عام

# subnet.scope.reserved
source: Reserved
ar: محجوز

# subnet.scope.thisNetwork
source: This network (0/8)
ar: هذه الشبكة (0/8)

# subnet.section.binary
source: Binary
ar: التمثيل الثنائي

# subnet.section.ipv6
source: IPv6 Details
ar: تفاصيل IPv6

# subnet.section.masks
source: Masks & Classification
ar: الأقنعة والتصنيف

# subnet.section.network
source: Network
ar: الشبكة

# subnet.v6.documentation
source: Documentation (2001:db8::/32)
ar: للتوثيق (2001:db8::/32)

# subnet.v6.globalUnicast
source: Global unicast
ar: أحادي عالمي

# subnet.v6.linkLocal
source: Link-local (fe80::/10)
ar: محلي الوصلة (fe80::/10)

# subnet.v6.loopback
source: Loopback (::1)
ar: استرجاع (::1)

# subnet.v6.multicast
source: Multicast (ff00::/8)
ar: بث متعدد (ff00::/8)

# subnet.v6.uniqueLocal
source: Unique local (fc00::/7)
ar: محلي فريد (fc00::/7)

# subnet.v6.unspecified
source: Unspecified (::)
ar: غير محدد (::)

# tool.mac.subtitle
source: Normalize any MAC format and identify the vendor offline
ar: توحيد صيغة أي عنوان MAC ومعرفة الشركة المصنّعة دون اتصال

# tool.mac.title
source: MAC / OUI Lookup
ar: فحص MAC / الشركة المصنّعة

# tool.ports.subtitle
source: Searchable reference of well-known TCP/UDP ports
ar: مرجع قابل للبحث لأشهر منافذ TCP/UDP

# tool.ports.title
source: Common Ports
ar: المنافذ الشائعة

# tool.publicip.subtitle
source: Your public IP, country, city, ISP and ASN, plus local interface addresses
ar: عنوانك العام، الدولة، المدينة، المزوّد وASN، مع عناوين الجهاز المحلية

# tool.publicip.title
source: Public IP & ISP
ar: عنوان IP العام والمزوّد

# tool.selftest.subtitle
source: Run the engine test suite on-device — same vectors as the XCTest file
ar: شغّل حزمة اختبارات المحرك على الجهاز — نفس حالات ملف XCTest

# tool.selftest.title
source: Engine Self-Tests
ar: اختبارات المحرك الذاتية

# tool.subnet.subtitle
source: IPv4 & IPv6 subnetting: network, broadcast, hosts, masks and binary
ar: تقسيم IPv4 وIPv6: عنوان الشبكة، البث، المضيفات، الأقنعة والتمثيل الثنائي

# tool.subnet.title
source: Subnet Calculator
ar: حاسبة الشبكات الفرعية
